#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.www_staging_plancraftr_com: Refreshing state... [id=www.staging.plancraftr.com]
aws_s3_bucket.staging_plancraftr_com: Refreshing state... [id=staging.plancraftr.com]
aws_security_group.staging_server_plancraftr_sg: Refreshing state... [id=sg-0d58359eb5537be6f]
aws_instance.staging_server_plancraftr: Refreshing state... [id=i-00ff447d323f49b30]
aws_route53_record.staging_api_plancraftr: Refreshing state... [id=Z097947118UN4SFV6P8TX_staging.api.plancraftr.com_A]
aws_s3_bucket_website_configuration.static_website_config_s3_staging: Refreshing state... [id=staging.plancraftr.com]
aws_cloudfront_distribution.staging_distribution: Refreshing state... [id=EBI573YJ1ESVV]
aws_s3_bucket_public_access_block.allow_public_access_s3_www_staging: Refreshing state... [id=www.staging.plancraftr.com]
aws_s3_bucket_policy.allow_anyone_get_objects_s3_www_staging: Refreshing state... [id=www.staging.plancraftr.com]
aws_s3_bucket_website_configuration.static_website_config_s3_www_staging: Refreshing state... [id=www.staging.plancraftr.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.www_staging_distribution will be created
  + resource "aws_cloudfront_distribution" "www_staging_distribution" {
      + aliases                         = [
          + "www.staging.plancraftr.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = true
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "www_staging_s3_origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "www.staging.plancraftr.com.s3.ap-southeast-1.amazonaws.com"
          + origin_id           = "www_staging_s3_origin"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:084828604403:certificate/59114432-b5de-4dcd-b632-18ce0761e813"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_route53_record.staging_plancraftr will be created
  + resource "aws_route53_record" "staging_plancraftr" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.plancraftr.com"
      + type            = "A"
      + zone_id         = "Z097947118UN4SFV6P8TX"

      + alias {
          + evaluate_target_health = false
          + name                   = "s3-website-ap-southeast-1.amazonaws.com"
          + zone_id                = "Z3O0J2DXBE1FTB"
        }
    }

  # aws_route53_record.www_staging_plancraftr will be created
  + resource "aws_route53_record" "www_staging_plancraftr" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.staging.plancraftr.com"
      + type            = "A"
      + zone_id         = "Z097947118UN4SFV6P8TX"

      + alias {
          + evaluate_target_health = false
          + name                   = "s3-website-ap-southeast-1.amazonaws.com"
          + zone_id                = "Z3O0J2DXBE1FTB"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @hasangawr, Action: `pull_request`*